INSERT INTO Customer (CustomerName, IDCard, Phone, Address)
VALUES
('张伟', '440101200001010011', '13800000001', '广州市天河区'),
('李娜', '440102200102020022', '13800000002', '广州市越秀区'),
('王强', '440103199912030033', '13800000003', '佛山市禅城区'),
('刘洋', '440104200203040044', '13800000004', '佛山市南海区'),
('陈杰', '440305200105050055', '13800000005', '深圳市福田区'),
('黄敏', '440306200206060066', '13800000006', '深圳市南山区'),
('赵磊', '441901200007070077', '13800000007', '东莞市南城区'),
('周婷', '440402200108080088', '13800000008', '珠海市香洲区'),
('吴涛', '440101199909090099', '13800000009', '广州市天河区'),
('林静', '440102200210100010', '13800000010', '广州市越秀区');
INSERT INTO Branch (BranchName, Address, Phone)
VALUES
('广州天河支行', '广州市天河区天河路100号', '020-38000001'),
('广州越秀支行', '广州市越秀区中山五路200号', '020-38000002'),
('佛山禅城支行', '佛山市禅城区季华五路88号', '0757-83000003'),
('佛山南海支行', '佛山市南海区桂城街道100号', '0757-86000004'),
('深圳福田支行', '深圳市福田区福华三路50号', '0755-83000005'),
('深圳南山支行', '深圳市南山区深南大道500号', '0755-86000006'),
('东莞南城支行', '东莞市南城区鸿福路66号', '0769-22000007'),
('珠海香洲支行', '珠海市香洲区凤凰北路88号', '0756-22000008');

INSERT INTO Account
(AccountNo, CustomerID, BranchID, AccountType, Balance)
VALUES
('6222000000020001', 3, 1, '储蓄账户', 0),
('6222000000020002', 5, 1, '活期账户', 0),
('6222000000020003', 1, 2, '储蓄账户', 0),
('6222000000020004', 7, 3, '活期账户', 0),
('6222000000020005', 2, 4, '储蓄账户', 0),
('6222000000020006', 8, 5, '储蓄账户', 0),
('6222000000020007', 4, 6, '活期账户', 0),
('6222000000020008', 6, 7, '储蓄账户', 0),
('6222000000020009', 10, 8, '活期账户', 0);

-- 账户1 存款1000
EXEC DepositMoney
    @AccountNo = '6222000000020001',
    @Amount = 1000;

-- 账户2 存款2000
EXEC DepositMoney
    @AccountNo = '6222000000020002',
    @Amount = 2000;

-- 账户3 存款3000
EXEC DepositMoney
    @AccountNo = '6222000000020003',
    @Amount = 3000;

-- 账户4 存款4000
EXEC DepositMoney
    @AccountNo = '6222000000020004',
    @Amount = 4000;

-- 账户5 存款5000
EXEC DepositMoney
    @AccountNo = '6222000000020005',
    @Amount = 5000;

-- 账户6 存款6000
EXEC DepositMoney
    @AccountNo = '6222000000020006',
    @Amount = 6000;

-- 账户7 存款7000
EXEC DepositMoney
    @AccountNo = '6222000000020007',
    @Amount = 7000;

-- 账户8 存款8000
EXEC DepositMoney
    @AccountNo = '6222000000020008',
    @Amount = 8000;

    EXEC WithdrawMoney
    @AccountNo = '6222000000020001',
    @Amount = 200;

EXEC WithdrawMoney
    @AccountNo = '6222000000020002',
    @Amount = 500;

EXEC WithdrawMoney
    @AccountNo = '6222000000020003',
    @Amount = 800;

EXEC WithdrawMoney
    @AccountNo = '6222000000020004',
    @Amount = 1000;


EXEC TransferMoney
    @FromAccountNo = '6222000000020001',
    @ToAccountNo = '6222000000020002',
    @Amount = 300;

    USE BankSystem;
GO

USE BankSystem;
GO
--增加存款
EXEC DepositMoney '6222000000020001', 800;
EXEC DepositMoney '6222000000020002', 1200;
EXEC DepositMoney '6222000000020003', 600;
EXEC DepositMoney '6222000000020004', 1500;
EXEC DepositMoney '6222000000020005', 700;
EXEC DepositMoney '6222000000020006', 1000;
EXEC DepositMoney '6222000000020007', 900;
EXEC DepositMoney '6222000000020008', 1300;
EXEC DepositMoney '6222000000020009', 500;

GO
-- 账户2 取款300
EXEC WithdrawMoney '6222000000020002', 300;

-- 账户3 取款400
EXEC WithdrawMoney '6222000000020003', 400;

-- 账户4 取款500
EXEC WithdrawMoney '6222000000020004', 500;

-- 账户5 取款600
EXEC WithdrawMoney '6222000000020005', 600;

-- 账户6 取款800
EXEC WithdrawMoney '6222000000020006', 800;

-- 账户7 取款500
EXEC WithdrawMoney '6222000000020007', 500;

-- 账户8 取款700
EXEC WithdrawMoney '6222000000020008', 700;

-- 再增加几笔
EXEC WithdrawMoney '6222000000020002', 200;
EXEC WithdrawMoney '6222000000020004', 300;
EXEC WithdrawMoney '6222000000020006', 500;
GO

-- 账户2 → 账户3，转账300
EXEC TransferMoney
    '6222000000020002',
    '6222000000020003',
    300;

-- 账户4 → 账户5，转账500
EXEC TransferMoney
    '6222000000020004',
    '6222000000020005',
    500;

-- 账户6 → 账户7，转账800
EXEC TransferMoney
    '6222000000020006',
    '6222000000020007',
    800;

-- 账户7 → 账户8，转账600
EXEC TransferMoney
    '6222000000020007',
    '6222000000020008',
    600;

-- 账户5 → 账户2，转账400
EXEC TransferMoney
    '6222000000020005',
    '6222000000020002',
    400;
GO